research-topics/PID.org
#+title: Private Information Delivery
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../style.css" />
#+OPTIONS: html-style:nil toc:nil title:nil num:nil timestamp:nil

#+begin_export html
<ul class="sidebar" id="mySideNav">
  <a href="javascript:void(0);" class="icon" onclick="myFunction()"><b>MENU</b></a>
  <a href="../index.html">Home</a>
  <a class="active" href="../research-topics/index.html">Research Topics</a>
  <a href="../publications.html">Publications</a>
  <a href="../projects/index.html">Projects</a>
  <a href="../bio.html">Bio</a>
</ul>
#+end_export

#+INCLUDE: ../logo.org

* Introduction
The problem of *Private Information Delivery* (PID) was introduced by /Hua Sun/ in ``Private Information Delivery'', Vol.66, No.12, pp. 7672-7683, 2020.  10.1109/ITW44776.2019.8989217. In PID, a dataset comprised of \(K\) identically distributed messages is stored over \(N\) servers. The servers want to convey one of the \(K\) messages to a user but don't want the identity of message to be disclosed to the user. For example, the data stored at the servers could be medical records of patients from some hospitals. These hospitals want to send the record of one of the patients externally but want to preserve the privacy of the patient.

In order to convey a message to the user, without disclosing the identity of the message servers may have to transmit more data than the actual size of message. Because of this, the goal of PID problem is to reduce /transmission cost/ while keeping the identity of message private. The /rate/ of PID is defined as the ratio of size of the message conveyed to the user, to the amount of data sent to the user via transmissions to convey that message. Therefore in PID problems, the goal is to maximize the rate.

* Our Contributions
In the PID problems in ``Private Information Delivery'', Vol.66, No.12, pp. 7672-7683, 2020.10.1109/ITW44776.2019.8989217 whole messages are stored at the servers without coding or splitting. Whereas we consider the case of distributed systems, where a message can be accessed by a proper subset of servers and messages which are available to the servers can be split and coded before storing them at the servers. By using coded storage at the servers, we establish that the message can be delivered privately to the user while requiring less storage and transmitting less data. Specifically, for a class of problems called /bi-regular PID/ we characterize the capacity for \(N=K/M\) and for \(N>K/M\) we provide achievable schemes. In both the cases the rates achieved are more than the rates achievable with the replicated systems.

** Publications
- Kanishak Vaidya and B. Sundar Rajan, ``Private Information Delivery with Coded Storage,'' 2022 IEEE International Symposium on Information Theory, 2022, pp. 2011-2015, doi: 10.1109/ISIT50566.2022.9834634.
- Kanishak Vaidya and B. Sundar Rajan, ``Private Information Delivery with Coded Storage,'' ArXiV, Feburary 8, 2022. arXiv:2202.03803.
