docs/research-topics/PID.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Private Information Delivery</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../style.css" />
</head>
<body>
<div id="content" class="content">
<ul class="sidebar" id="mySideNav">
  <a href="javascript:void(0);" class="icon" onclick="myFunction()"><b>MENU</b></a>
  <a href="../index.html">Home</a>
  <a class="active" href="../research-topics/_index.html">Research Topics</a>
  <a href="../publications.html">Publications</a>
  <a href="../projects/_index.html">Projects</a>
  <a href="../bio.html">Bio</a>
</ul>

<div class="logo">
<a class="logo__link" title="Kanishak Vaidya" rel="home">
<div class="logo__item logo__text">
<div class="logo__title">Kanishak Vaidya</div>
<div class="logo__tagline">PhD fellow in IISc Bangalore</div>
</div></a>
<!-- div style="float:right;">
  <div class="toggle-light light" ></div >
</div-->
</div>

<script>
function myFunction() {
  var x = document.getElementById("mySideNav");
  if (x.className === "sidebar") {
    x.className += " responsive";
  } else {
    x.className = "sidebar";
  }
}
</script>

<div id="outline-container-orgaf02eb9" class="outline-2">
<h2 id="orgaf02eb9">Introduction</h2>
<div class="outline-text-2" id="text-orgaf02eb9">
<p>
The problem of <b>Private Information Delivery</b> (PID) was introduced by <i>Hua Sun</i> in ``Private Information Delivery&rsquo;&rsquo;, Vol.66, No.12, pp. 7672-7683, 2020.  10.1109/ITW44776.2019.8989217. In PID, a dataset comprised of \(K\) identically distributed messages is stored over \(N\) servers. The servers want to convey one of the \(K\) messages to a user but don&rsquo;t want the identity of message to be disclosed to the user. For example, the data stored at the servers could be medical records of patients from some hospitals. These hospitals want to send the record of one of the patients externally but want to preserve the privacy of the patient.
</p>

<p>
In order to convey a message to the user, without disclosing the identity of the message servers may have to transmit more data than the actual size of message. Because of this, the goal of PID problem is to reduce <i>transmission cost</i> while keeping the identity of message private. The <i>rate</i> of PID is defined as the ratio of size of the message conveyed to the user, to the amount of data sent to the user via transmissions to convey that message. Therefore in PID problems, the goal is to maximize the rate.
</p>
</div>
</div>

<div id="outline-container-org107c38a" class="outline-2">
<h2 id="org107c38a">Our Contributions</h2>
<div class="outline-text-2" id="text-org107c38a">
<p>
In the PID problems in ``Private Information Delivery&rsquo;&rsquo;, Vol.66, No.12, pp. 7672-7683, 2020.10.1109/ITW44776.2019.8989217 whole messages are stored at the servers without coding or splitting. Whereas we consider the case of distributed systems, where a message can be accessed by a proper subset of servers and messages which are available to the servers can be split and coded before storing them at the servers. By using coded storage at the servers, we establish that the message can be delivered privately to the user while requiring less storage and transmitting less data. Specifically, for a class of problems called <i>bi-regular PID</i> we characterize the capacity for \(N=K/M\) and for \(N>K/M\) we provide achievable schemes. In both the cases the rates achieved are more than the rates achievable with the replicated systems.
</p>
</div>

<div id="outline-container-orga23d8f0" class="outline-3">
<h3 id="orga23d8f0">Publications</h3>
<div class="outline-text-3" id="text-orga23d8f0">
<ul class="org-ul">
<li>Kanishak Vaidya and B. Sundar Rajan, ``Private Information Delivery with Coded Storage,&rsquo;&rsquo; 2022 IEEE International Symposium on Information Theory, 2022, pp. 2011-2015, doi: 10.1109/ISIT50566.2022.9834634.</li>
<li>Kanishak Vaidya and B. Sundar Rajan, ``Private Information Delivery with Coded Storage,&rsquo;&rsquo; ArXiV, Feburary 8, 2022. arXiv:2202.03803.</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
